src/InformationRegisters/ШтрихкодыТоваров/ШтрихкодыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <comment>Ссылка пустая для штрихкодов без номенклатуры.</comment>
    <type>
      <types>CatalogRef.НоменклатураРозница</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/Перемещения/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Функция определяет существует ли номенклатура с данным штрихкодом и либо добавляет товар
// в перемещение товаров, либо увеличивает счетчик количества.
// 
// Параметры:
//  ПеремещениеТоваров - ДокументСсылка.ПеремещениеТоваров
//  ШтрихкодТовара - Строка
// 
// Возвращаемое значение:
//  См. НовоеОписаниеОбработкиШтрихкода
Функция ОбработатьШтрихкодТовара(Знач ПеремещениеТоваров, Знач ШтрихкодТовара) Экспорт
    
    НачатьТранзакцию();

    Попытка

        ОписаниеОбработкиШтрихкода = НовоеОписаниеОбработкиШтрихкода();
        
        // 1. Поиск номенклатуры по штрихкоду 
        Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                              |    ВсеШтрихкодыНоменклатуры.Ссылка КАК Номенклатура
                              |ИЗ
                              |    Справочник.НоменклатураРозница.Штрихкоды КАК ВсеШтрихкодыНоменклатуры
                              |ГДЕ
                              |    ВсеШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");

        Запрос.УстановитьПараметр("Штрихкод", ШтрихкодТовара);
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();

        Если Не Выборка.Следующий() Тогда

            ОтменитьТранзакцию();

            ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаНеНайденаНоменклатура();

            Возврат ОписаниеОбработкиШтрихкода;

        КонецЕсли;

        //@skip-check property-return-type
        НоменклатураТовара = Выборка.Номенклатура; // СправочникСсылка.НоменклатураРозница
        
        // 2. Увеличение количества товара или добавление нового товара
        Если ШтрихкодЕстьВПеремещении(ПеремещениеТоваров, ШтрихкодТовара) Тогда

            НовоеКоличество = УвеличитьКоличествоТовара(ПеремещениеТоваров, ШтрихкодТовара, НоменклатураТовара);
            ОписаниеОбработкиШтрихкода.НовоеКоличество = НовоеКоличество;
            ОписаниеОбработкиШтрихкода.ПредыдущееКоличество = НовоеКоличество - 1;

        Иначе

            ДобавитьТоварВПеремещение(ПеремещениеТоваров, ШтрихкодТовара, НоменклатураТовара);
            ОписаниеОбработкиШтрихкода.НовоеКоличество = 1;
            ОписаниеОбработкиШтрихкода.ПредыдущееКоличество = 0;

        КонецЕсли;

        ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаТоварНайден();

        ЗафиксироватьТранзакцию();

        Возврат ОписаниеОбработкиШтрихкода;

    Исключение

        ОтменитьТранзакцию();
        ВызватьИсключение;

    КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция создает описание обработки штрихкода.
// 
// Возвращаемое значение:
//  Структура - Описание обработки штрихкода:
// * КодВозврата - Число - Код, указывающий на результат обработки штрихкода
// * ПредыдущееКоличество - Неопределено, Число - Значение реквизита "Количество" до обработки штрихкода
// * НовоеКоличество - Неопределено, Число - Значение реквизита "Количество" после обработки штрихкода
Функция НовоеОписаниеОбработкиШтрихкода() Экспорт

    ОписаниеОбработкиШтрихкода = Новый Структура;

    ОписаниеОбработкиШтрихкода.Вставить("КодВозврата", КодВозвратаУспех());
    ОписаниеОбработкиШтрихкода.Вставить("ПредыдущееКоличество", Неопределено);
    ОписаниеОбработкиШтрихкода.Вставить("НовоеКоличество", Неопределено);

    Возврат ОписаниеОбработкиШтрихкода;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. РегистрСведенийМенеджер.ШтрихкодыТоваров.ЕстьШтрихкод
Функция ШтрихкодЕстьВПеремещении(Знач Документ, Знач Штрихкод)

    Возврат РегистрыСведений.ШтрихкодыТоваров.ЕстьШтрихкод(Документ, Штрихкод);

КонецФункции

// См. РегистрСведенийМенеджер.ШтрихкодыТоваров.ДобавитьШтрихкод
Процедура ДобавитьТоварВПеремещение(Знач Документ, Знач Штрихкод, Знач Номенклатура)

    РегистрыСведений.ШтрихкодыТоваров.ДобавитьШтрихкод(Документ, Штрихкод, Номенклатура);

КонецПроцедуры

// См. РегистрСведенийМенеджер.ШтрихкодыТоваров.УвеличитьКоличество
Функция УвеличитьКоличествоТовара(Знач Документ, Знач Штрихкод, Знач Номенклатура)

    Возврат РегистрыСведений.ШтрихкодыТоваров.УвеличитьКоличество(Документ, Штрихкод, Номенклатура);

КонецФункции

#КонецОбласти
